Repository: christianulson/DbSqlLikeMem
Catalog: src/DbSqlLikeMem/Resources/SqlExceptionMessages.*.resx
Languages: pt

# DuplicateKey
source: Duplicate entry '{0}' for key '{1}'
pt: Entrada duplicada '{0}' para a chave '{1}'

# UnknownColumn
source: Unknown column '{0}'
pt: Coluna desconhecida '{0}'

# ColumnCannotBeNull
source: Column '{0}' cannot be null
pt: A coluna '{0}' não pode ser nula

# ForeignKeyFails
source: Cannot add or update a child row: a foreign key constraint fails ({0} â†’ {1})
pt: Não é possível adicionar ou atualizar uma linha filha: a restrição de chave estrangeira falhou ({0} → {1})

# ReferencedRow
source: Cannot delete or update a parent row: a foreign key constraint fails (child referencing '{0}')
pt: Não é possível excluir ou atualizar uma linha pai: a restrição de chave estrangeira falhou (filho referenciando '{0}')

# ParameterAlreadyDefined
source: Parameter '{0}' has already been defined.
pt: Parâmetro '{0}' já foi definido.

# ParameterNotFoundInCollection
source: Parameter '{0}' not found in the collection
pt: Parâmetro '{0}' não encontrado na coleção

source: Invalid CREATE TEMPORARY TABLE statement.
pt: Instrução CREATE TEMPORARY TABLE inválida.

source: Invalid CREATE VIEW statement.
pt: Instrução CREATE VIEW inválida.

# InvalidDeleteExpectedFromKeyword
source: Invalid DELETE statement: expected FROM keyword.
pt: Instrução DELETE inválida: era esperada a palavra-chave FROM.

# UseExecuteReaderForSelect
source: Use ExecuteReader for SELECT commands.
pt: Use ExecuteReader para comandos SELECT.

# UseExecuteReaderForSelectUnion
source: Use ExecuteReader for SELECT/UNION commands.
pt: Use ExecuteReader para comandos SELECT/UNION.

# ExecuteReaderWithoutSelectQuery
source: ExecuteReader was called, but no SELECT query was found.
pt: ExecuteReader foi chamado, mas nenhuma query SELECT foi encontrada.

source: Invalid DROP VIEW statement.
pt: Instrução DROP VIEW inválida.

# ParameterNotFound
source: Parameter {0} not found.
pt: Parâmetro {0} não encontrado.

source: Column does not accept NULL
pt: Coluna não aceita NULL

# DataTooLongForColumn
source: Data too long for column '{0}'
pt: Dados longos demais para a coluna '{0}'

# DataTruncatedForColumn
source: Data truncated for column '{0}'
pt: Dados truncados para a coluna '{0}'
