Repository: christianulson/DbSqlLikeMem
Catalog: src/DbSqlLikeMem/Resources/SqlExecutionPlanMessages.*.resx
Languages: de, es, fr, it, pt

# ExecutionPlanTitle
source: Execution Plan (mock)
de: Ausführungsplan (mock)
es: Plan de Ejecución (mock)
fr: Plan d'exécution (mock)
it: Piano di Esecuzione (mock)
pt: Plano de Execução (mock)

# QueryTypeLabel
source: QueryType
de: AbfrageTyp
es: TipoConsulta
fr: TypeRequete
it: TipoQuery
pt: TipoConsulta

# EstimatedCostLabel
source: EstimatedCost
de: GeschaetzteKosten
es: CostoEstimado
fr: CoutEstime
it: CostoStimato
pt: CustoEstimado

# ProjectionLabel
source: Projection
de: Projektion
es: Proyección
it: Proiezione
pt: Projeção

# InputTablesLabel
source: InputTables
de: EingabeTabellen
es: TablasEntrada
fr: TablesEntree
it: TabelleInput
pt: TabelasEntrada

# EstimatedRowsReadLabel
source: EstimatedRowsRead
de: GeschaetzteGeleseneZeilen
es: FilasEstimadasLeidas
fr: LignesEstimeesLues
it: RigheStimateLette
pt: LinhasEstimadasLidas

# ActualRowsLabel
source: ActualRows
de: TatsaechlicheZeilen
es: FilasReales
fr: LignesReelles
it: RigheReali
pt: LinhasReais

# SelectivityPctLabel
source: SelectivityPct
de: SelektivitaetPct
es: SelectividadPct
fr: SelectivitePct
it: SelettivitaPct
pt: SeletividadePct

# RowsPerMsLabel
source: RowsPerMs
de: ZeilenProMs
es: FilasPorMs
fr: LignesParMs
it: RighePerMs
pt: LinhasPorMs

# ElapsedMsLabel
source: ElapsedMs
de: VerstricheneMs
es: TiempoTranscurridoMs
fr: TempsEcouleMs
it: TempoTrascorsoMs
pt: TempoDecorridoMs

# IndexRecommendationsLabel
source: IndexRecommendations
de: IndexEmpfehlungen
es: RecomendacionesIndice
fr: RecommandationsIndex
it: RaccomandazioniIndice
pt: RecomendacoesIndice

# TableLabel
source: Table
de: Tabelle
es: Tabla
it: Tabella
pt: Tabela

# SuggestedIndexLabel
source: SuggestedIndex
de: VorgeschlagenerIndex
es: IndiceSugerido
fr: IndexSuggere
it: IndiceSuggerito
pt: IndiceSugerido

# ReasonLabel
source: Reason
de: Grund
es: Motivo
fr: Raison
it: Motivo
pt: Motivo

# ConfidenceLabel
source: Confidence
de: Konfidenz
es: Confianza
fr: Confiance
it: Confidenza
pt: Confianca

# EstimatedRowsReadBeforeLabel
source: EstimatedRowsReadBefore
de: GeschaetzteGeleseneZeilenVorher
es: FilasEstimadasLeidasAntes
fr: LignesEstimeesLuesAvant
it: RigheStimateLettePrima
pt: LinhasEstimadasLidasAntes

# EstimatedRowsReadAfterLabel
source: EstimatedRowsReadAfter
de: GeschaetzteGeleseneZeilenNachher
es: FilasEstimadasLeidasDespues
fr: LignesEstimeesLuesApres
it: RigheStimateLetteDopo
pt: LinhasEstimadasLidasDepois

# EstimatedGainPctLabel
source: EstimatedGainPct
de: GeschaetzterGewinnPct
es: GananciaEstimadaPct
fr: GainEstimePct
it: GuadagnoStimatoPct
pt: GanhoEstimadoPct

# PartsLabel
source: Parts
de: Teile
es: Partes
fr: Parties
it: Parti
pt: Partes

# PartLabel
source: Part
de: Teil
es: Parte
fr: Partie
it: Parte
pt: Parte

# CombineLabel
source: Combine
de: Kombinieren
es: Combinar
fr: Combiner
it: Combina
pt: Combinar

# ReasonFilterAndOrder
source: WHERE/JOIN ({0}) + ORDER BY ({1}) without a matching index. Suggested key: {2}.
de: WHERE/JOIN ({0}) + ORDER BY ({1}) ohne passenden Index. Vorgeschlagener Schlüssel: {2}.
es: WHERE/JOIN ({0}) + ORDER BY ({1}) sin índice compatible. Clave sugerida: {2}.
fr: WHERE/JOIN ({0}) + ORDER BY ({1}) sans index compatible. Clé suggérée : {2}.
it: WHERE/JOIN ({0}) + ORDER BY ({1}) senza indice corrispondente. Chiave suggerita: {2}.
pt: WHERE/JOIN ({0}) + ORDER BY ({1}) sem índice aderente. Chave sugerida: {2}.

# ReasonFilterOnly
source: WHERE/JOIN predicates ({0}) without a matching index.
de: WHERE/JOIN-Prädikate ({0}) ohne passenden Index.
es: Predicados WHERE/JOIN ({0}) sin índice compatible.
fr: Prédicats WHERE/JOIN ({0}) sans index compatible.
it: Predicati WHERE/JOIN ({0}) senza indice corrispondente.
pt: Predicados WHERE/JOIN ({0}) sem índice aderente.

# ReasonOrderOnly
source: ORDER BY ({0}) without a matching index.
de: ORDER BY ({0}) ohne passenden Index.
es: ORDER BY ({0}) sin índice compatible.
fr: ORDER BY ({0}) sans index compatible.
it: ORDER BY ({0}) senza indice corrispondente.
pt: ORDER BY ({0}) sem índice aderente.

# PlanWarningsLabel
source: PlanWarnings
de: PlanWarnungen
es: AdvertenciasPlan
fr: AlertesPlan
it: AvvisiPiano
pt: AlertasPlano

# CodeLabel
source: Code
es: Codigo
it: Codice
pt: Codigo

# MessageLabel
source: Message
de: Meldung
es: Mensaje
it: Messaggio
pt: Mensagem

# SuggestedActionLabel
source: SuggestedAction
de: EmpfohleneAktion
es: AccionSugerida
fr: ActionSuggeree
it: AzioneSuggerita
pt: AcaoSugerida

# SeverityLabel
source: Severity
de: Schweregrad
es: Severidad
fr: Severite
it: Gravita
pt: Severidade

# WarningOrderByWithoutLimitMessage
source: ORDER BY may be expensive without LIMIT/TOP/FETCH.
de: ORDER BY kann ohne LIMIT/TOP/FETCH teuer sein.
es: ORDER BY puede ser costoso sin LIMIT/TOP/FETCH.
fr: ORDER BY peut être coûteux sans LIMIT/TOP/FETCH.
it: ORDER BY può essere costoso senza LIMIT/TOP/FETCH.
pt: ORDER BY pode ser custoso sem LIMIT/TOP/FETCH.

# WarningOrderByWithoutLimitReason
source: ORDER BY is sorting an estimated {0} rows without LIMIT/TOP/FETCH.
de: ORDER BY sortiert geschätzt {0} Zeilen ohne LIMIT/TOP/FETCH.
es: ORDER BY está ordenando aproximadamente {0} filas estimadas sin LIMIT/TOP/FETCH.
fr: ORDER BY trie environ {0} lignes estimées sans LIMIT/TOP/FETCH.
it: ORDER BY sta ordinando circa {0} righe stimate senza LIMIT/TOP/FETCH.
pt: ORDER BY está ordenando cerca de {0} linhas estimadas sem LIMIT/TOP/FETCH.

# WarningOrderByWithoutLimitAction
source: Use LIMIT/TOP/FETCH when possible, or create/support an index aligned with ORDER BY columns.
de: Verwenden Sie nach Möglichkeit LIMIT/TOP/FETCH oder erstellen/pflegen Sie einen auf ORDER BY ausgerichteten Index.
es: Use LIMIT/TOP/FETCH cuando sea posible, o cree/mantenga un índice alineado con las columnas de ORDER BY.
fr: Utilisez LIMIT/TOP/FETCH lorsque possible, ou créez/maintenez un index aligné sur les colonnes de ORDER BY.
it: Usa LIMIT/TOP/FETCH quando possibile oppure crea/mantieni un indice allineato alle colonne di ORDER BY.
pt: Use LIMIT/TOP/FETCH quando possível, ou crie/sustente um índice alinhado às colunas de ORDER BY.

# WarningLowSelectivityMessage
source: Low selectivity detected with high read volume.
de: Niedrige Selektivität bei hohem Lesevolumen erkannt.
es: Se detectó baja selectividad con alto volumen de lectura.
fr: Faible sélectivité détectée avec un volume de lecture élevé.
it: Bassa selettività rilevata con alto volume di lettura.
pt: Baixa seletividade detectada com alto volume de leitura.

# WarningLowSelectivityReason
source: Query returned a high percentage of scanned rows (SelectivityPct={0:F2}) with EstimatedRowsRead={1}.
de: Die Abfrage gab einen hohen Prozentsatz gescannter Zeilen zurück (SelectivityPct={0:F2}) bei EstimatedRowsRead={1}.
es: La consulta devolvió un alto porcentaje de las filas escaneadas (SelectivityPct={0:F2}) con EstimatedRowsRead={1}.
fr: La requête a retourné un pourcentage élevé des lignes scannées (SelectivityPct={0:F2}) avec EstimatedRowsRead={1}.
it: La query ha restituito un'alta percentuale delle righe scansionate (SelectivityPct={0:F2}) con EstimatedRowsRead={1}.
pt: A consulta retornou alta porcentagem das linhas varridas (SelectivityPct={0:F2}) com EstimatedRowsRead={1}.

# WarningLowSelectivityAction
source: Refine WHERE predicates and verify if additional selective predicates or indexes are needed.
de: Verfeinern Sie WHERE-Prädikate und prüfen Sie, ob zusätzliche selektive Prädikate oder Indizes nötig sind.
es: Refine los predicados de WHERE y verifique si se necesitan predicados más selectivos o índices.
fr: Affinez les prédicats WHERE et vérifiez si des prédicats plus sélectifs ou des index sont nécessaires.
it: Affina i predicati WHERE e verifica se sono necessari predicati più selettivi o indici.
pt: Refine os predicados de WHERE e verifique se são necessários predicados mais seletivos ou índices.

# WarningSelectStarMessage
source: SELECT * on high-read query can increase I/O and memory usage.
de: SELECT * bei hoher Leselast kann I/O- und Speichernutzung erhöhen.
es: SELECT * en una consulta de alta lectura puede aumentar el I/O y el uso de memoria.
fr: SELECT * sur une requête à forte lecture peut augmenter l'I/O et l'utilisation mémoire.
it: SELECT * su query ad alta lettura può aumentare I/O e uso memoria.
pt: SELECT * em consulta de alta leitura pode aumentar I/O e uso de memória.

# WarningSelectStarReason
source: SELECT * was used while EstimatedRowsRead is {0}.
de: SELECT * wurde verwendet, während EstimatedRowsRead bei {0} liegt.
es: Se utilizó SELECT * mientras EstimatedRowsRead es {0}.
fr: SELECT * a été utilisé alors que EstimatedRowsRead est {0}.
it: È stato usato SELECT * mentre EstimatedRowsRead è {0}.
pt: SELECT * foi usado enquanto EstimatedRowsRead é {0}.

# WarningSelectStarAction
source: Project only required columns instead of SELECT *.
de: Projizieren Sie nur benötigte Spalten statt SELECT *.
es: Proyecte solo las columnas necesarias en lugar de SELECT *.
fr: Projetez uniquement les colonnes nécessaires au lieu de SELECT *.
it: Proietta solo le colonne necessarie invece di SELECT *.
pt: Projete apenas as colunas necessárias em vez de SELECT *.

# MetricNameLabel
source: MetricName
de: Metrikname
fr: NomMétrique
it: NomeMetrica

# ObservedValueLabel
source: ObservedValue
de: BeobachteterWert
fr: ValeurObservée
it: ValoreOsservato

# ThresholdLabel
source: Threshold
de: Schwellenwert
fr: Seuil
it: Soglia

# WarningLowSelectivityHighImpactMessage
source: Very low selectivity detected with high read volume.
de: Sehr niedrige Selektivität bei hohem Lesevolumen erkannt.
fr: Très faible sélectivité détectée avec un volume de lecture élevé.
it: Rilevata selettività molto bassa con alto volume di lettura.

# WarningSelectStarHighImpactMessage
source: SELECT * on very high-read query has elevated I/O and memory risk.
de: SELECT * bei sehr hoher Leselast erhöht I/O- und Speicherrisiko deutlich.
fr: SELECT * sur une requête à très forte lecture présente un risque élevé d'I/O et de mémoire.
it: SELECT * su query con lettura molto alta aumenta il rischio di I/O e memoria.

# WarningSelectStarCriticalImpactMessage
source: SELECT * on extremely high-read query has critical I/O and memory risk.
de: SELECT * bei extrem hoher Leselast hat ein kritisches I/O- und Speicherrisiko.
fr: SELECT * sur une requête à lecture extrêmement élevée présente un risque critique d'I/O et de mémoire.
it: SELECT * su query con lettura estremamente alta ha rischio critico di I/O e memoria.

# WarningNoWhereHighReadMessage
source: High-read query without WHERE may trigger a full scan.
de: Abfrage mit hoher Leselast ohne WHERE kann einen vollständigen Scan auslösen.
fr: Une requête à forte lecture sans WHERE peut déclencher un scan complet.
it: Una query ad alta lettura senza WHERE può causare una scansione completa.
pt: Consulta de alta leitura sem WHERE pode causar full scan.

# WarningNoWhereHighReadHighImpactMessage
source: Very high-read query without WHERE has critical full-scan risk.
de: Abfrage mit sehr hoher Leselast ohne WHERE hat kritisches Vollscan-Risiko.
fr: Une requête à très forte lecture sans WHERE présente un risque critique de scan complet.
it: Una query con lettura molto alta senza WHERE ha rischio critico di scansione completa.
pt: Consulta de leitura muito alta sem WHERE tem risco crítico de full scan.

# WarningNoWhereHighReadReason
source: No WHERE predicate was provided while EstimatedRowsRead is {0}.
de: Kein WHERE-Prädikat angegeben, während EstimatedRowsRead {0} beträgt.
fr: Aucun prédicat WHERE n'a été fourni alors que EstimatedRowsRead est {0}.
it: Nessun predicato WHERE fornito mentre EstimatedRowsRead è {0}.
pt: Nenhum predicado WHERE foi informado enquanto EstimatedRowsRead é {0}.

# WarningNoWhereHighReadAction
source: Add selective WHERE predicates when possible or confirm that a full scan is intended.
de: Fügen Sie nach Möglichkeit selektive WHERE-Prädikate hinzu oder bestätigen Sie, dass ein Vollscan beabsichtigt ist.
fr: Ajoutez des prédicats WHERE sélectifs lorsque possible ou confirmez qu'un scan complet est intentionnel.
it: Aggiungi predicati WHERE selettivi quando possibile oppure conferma che la scansione completa è intenzionale.
pt: Adicione predicados WHERE seletivos quando possível ou confirme que o full scan é intencional.

# WarningDistinctHighReadMessage
source: DISTINCT on high-read query may add expensive deduplication cost.
de: DISTINCT bei Abfrage mit hoher Leselast kann teure Deduplizierung verursachen.
fr: DISTINCT sur une requête à forte lecture peut ajouter un coût élevé de déduplication.
it: DISTINCT su query ad alta lettura può aggiungere un costo elevato di deduplicazione.
pt: DISTINCT em consulta de alta leitura pode adicionar custo elevado de deduplicação.

# WarningDistinctHighReadHighImpactMessage
source: DISTINCT on very high-read query has critical deduplication cost risk.
de: DISTINCT bei Abfrage mit sehr hoher Leselast hat kritisches Deduplizierungsrisiko.
fr: DISTINCT sur une requête à très forte lecture présente un risque critique de coût de déduplication.
it: DISTINCT su query con lettura molto alta ha rischio critico di costo di deduplicazione.
pt: DISTINCT em consulta de leitura muito alta tem risco crítico de custo de deduplicação.

# WarningDistinctHighReadReason
source: DISTINCT is being applied while EstimatedRowsRead is {0}.
de: DISTINCT wird angewendet, während EstimatedRowsRead {0} beträgt.
fr: DISTINCT est appliqué alors que EstimatedRowsRead est de {0}.
it: DISTINCT è applicato mentre EstimatedRowsRead è {0}.
pt: DISTINCT está sendo aplicado enquanto EstimatedRowsRead é {0}.

# WarningDistinctHighReadAction
source: Use DISTINCT only when necessary and evaluate if filtering/indexing can reduce rows before deduplication.
de: Verwenden Sie DISTINCT nur wenn nötig und prüfen Sie, ob Filter/Indizes die Zeilen vor der Deduplizierung reduzieren können.
fr: Utilisez DISTINCT uniquement si nécessaire et vérifiez si des filtres/index peuvent réduire les lignes avant déduplication.
it: Usa DISTINCT solo quando necessario e valuta se filtri/indici possono ridurre le righe prima della deduplicazione.
pt: Use DISTINCT apenas quando necessário e avalie se filtros/índices podem reduzir linhas antes da deduplicação.

# SeverityInfoValue
source: Info
es: Informacion
fr: Information
it: Informazione
pt: Informacao

# SeverityWarningValue
source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
it: Avviso
pt: Aviso

# SeverityHighValue
source: High
de: Hoch
es: Alta
fr: Elevee
it: Alta
pt: Alta
