Repository: christianulson/DbSqlLikeMem
Catalog: src/DbSqlLikeMem.VisualStudioExtension/Properties/Resources.*.resx
Languages: pt_br

# ConnectionDialogTitle
source: Add connection
pt_br: Adicionar conexão

# NameLabel
source: Name:
pt_br: Nome:

# DatabaseLabel
source: Database:
pt_br: Banco:

# CancelButton
source: Cancel
pt_br: Cancelar

# SaveButton
source: Save
pt_br: Salvar

# ValidationTitle
source: Validation
pt_br: Validação

# FillConnectionNameAndString
source: Fill in name and connection string.
pt_br: Preencha nome e connection string.

# MappingDialogTitle
source: Configure mappings
pt_br: Configurar mapeamentos

# FilePatternLabel
source: File pattern:
pt_br: Padrão de arquivo:

# OutputDirectoryLabel
source: Output directory:
pt_br: Diretório de saída:

# FillMappingPatternAndOutput
source: Fill in file pattern and output directory.
pt_br: Preencha o padrão de arquivo e o diretório de saída.

# ObjectFilterDialogTitle
source: Item filter
pt_br: Filtro de itens

# FilterLabel
source: Filter:
pt_br: Filtro:

# ModeLabel
source: Mode:
pt_br: Modo:

# ContainsOption
source: Contains
pt_br: Contém

# ExactOption
source: Exact
pt_br: Exato

# ApplyButton
source: Apply
pt_br: Aplicar

# TemplateConfigTitle
source: Configure templates
pt_br: Configurar templates

# ModelTemplateLabel
source: Model template:
pt_br: Template Model:

# RepositoryTemplateLabel
source: Repository template:
pt_br: Template Repositório:

# ModelOutputLabel
source: Model output:
pt_br: Saída Models:

# RepositoryOutputLabel
source: Repository output:
pt_br: Saída Repositórios:

# OutputDirectoriesRequired
source: Provide output directories for Model and Repository.
pt_br: Informe os diretórios de saída para Model e Repositório.

# TemplateNotFound
source: Template not found: {0}
pt_br: Template não encontrado: {0}

# InvalidDirectoryWithDetail
source: Invalid directory or permission denied: {0}. Detail: {1}
pt_br: Diretório inválido ou sem permissão: {0}. Detalhe: {1}

# TestScenarioTitle
source: Extract test scenario
pt_br: Extrair cenário de teste

# ScenarioNameLabel
source: Scenario name:
pt_br: Nome do cenário:

# TableLabel
source: Table:
pt_br: Tabela:

# FilterSqlLabel
source: SQL Filter (WHERE):
pt_br: Filtro SQL (WHERE):

# IncludeParentsCheckbox
source: Include parent table data (FK)
pt_br: Incluir dados de tabelas pai (FK)

# LoadDataButton
source: Load data
pt_br: Carregar dados

# SelectAllButton
source: Select all
pt_br: Marcar todos

# ClearAllButton
source: Clear all
pt_br: Desmarcar todos

# ExtractScenarioButton
source: Extract scenario
pt_br: Extrair cenário

# CloseButton
source: Close
pt_br: Fechar

# AddConnectionButton
source: Add connection
pt_br: Adicionar conexão

# RefreshObjectsButton
source: Refresh objects
pt_br: Atualizar objetos

# ImportSettingsButton
source: Import settings
pt_br: Importar configurações

# ExportSettingsButton
source: Export settings
pt_br: Exportar configurações

# EditConnectionMenu
source: Edit connection
pt_br: Editar conexão

# CancelOperationMenu
source: Cancel operation
pt_br: Cancelar operação

# RemoveConnectionMenu
source: Remove connection
pt_br: Remover conexão

# ConfigureMappingsMenu
source: Configure mappings
pt_br: Configurar mapeamentos

# ConfigureTemplatesMenu
source: Configure templates
pt_br: Configurar templates

# FilterItemsMenu
source: Filter items...
pt_br: Filtrar itens...

# ClearFilterMenu
source: Clear filter
pt_br: Limpar filtro

# GenerateAllClassesMenu
source: Generate all classes
pt_br: Gerar todas as classes

# GenerateTestClassesMenu
source: Generate test classes
pt_br: Gerar classes de teste

# GenerateModelClassesMenu
source: Generate model classes
pt_br: Gerar classes de modelos

# GenerateRepositoryClassesMenu
source: Generate repository classes
pt_br: Gerar classes de repositório

# CheckConsistencyMenu
source: Check consistency
pt_br: Checar consistência

# ExtractTestScenarioMenu
source: Extract test scenario
pt_br: Extrair cenário de teste

# ConnectionFailureTitle
source: Connection failure
pt_br: Falha de conexão

# SelectConnectionToEdit
source: Select a connection node to edit.
pt_br: Selecione um nó de conexão para editar.

# SelectConnectionToRemove
source: Select a connection node to remove.
pt_br: Selecione um nó de conexão para remover.

# ConfirmTitle
source: Confirmation
pt_br: Confirmação

# RemoveConnectionQuestion
source: Remove connection '{0}'?
pt_br: Remover conexão '{0}'?

# ImportSettingsDialogTitle
source: Import settings
pt_br: Importar configurações

# ExportSettingsDialogTitle
source: Export settings
pt_br: Exportar configurações

# JsonFileFilter
source: JSON files (*.json)|*.json|All files (*.*)|*.*
pt_br: Arquivos JSON (*.json)|*.json|Todos os arquivos (*.*)|*.*

# GenerateClassesTitle
source: Generate classes
pt_br: Gerar classes

# OverwritePreviewTitle
source: Overwrite preview
pt_br: Pré-visualização de sobrescrita

# OverwritePreviewMessage
source: {0} file(s) already exist and will be overwritten:{1}{1}{2}
pt_br: {0} arquivo(s) já existem e serão sobrescritos:{1}{1}{2}

# UnexpectedErrorTitle
source: Unexpected error
pt_br: Erro inesperado

# SelectNodeToGenerateClasses
source: Select a connection, object type or object to generate classes.
pt_br: Selecione conexão, tipo de objeto ou objeto para gerar classes.

# SelectNodeToGenerateTestClasses
source: Select a connection, object type or object to generate test classes.
pt_br: Selecione conexão, tipo de objeto ou objeto para gerar classes de teste.

# SelectNodeToGenerateModelClasses
source: Select a connection, object type or object to generate model classes.
pt_br: Selecione conexão, tipo de objeto ou objeto para gerar classes de modelos.

# SelectNodeToGenerateRepositoryClasses
source: Select a connection, object type or object to generate repository classes.
pt_br: Selecione conexão, tipo de objeto ou objeto para gerar classes de repositório.

# SelectNodeToCheckConsistency
source: Select a connection, object type or object to check consistency.
pt_br: Selecione conexão, tipo de objeto ou objeto para checar consistência.

# SelectNodeToExtractScenario
source: Select a connection, object type or table to extract scenario.
pt_br: Selecione uma conexão, tipo de objeto ou tabela para extrair cenário.

# NoTablesFoundInConnection
source: No tables found in this connection.
pt_br: Nenhuma tabela encontrada nesta conexão.

# SelectTableMessage
source: Select a table.
pt_br: Selecione uma tabela.

# ProvideScenarioNameMessage
source: Provide a scenario name.
pt_br: Informe um nome para o cenário.

# SelectAtLeastOneRowMessage
source: Select at least one row for extraction.
pt_br: Selecione ao menos uma linha para extração.

# ScenarioExtractedWithFile
source: Scenario extracted successfully.{0}File: {1}
pt_br: Cenário extraído com sucesso.{0}Arquivo: {1}

# FailedCreateConnection
source: Failed to create connection.
pt_br: Falha ao criar conexão.

source: Connection validated successfully.
pt_br: Conexão validada com sucesso.

# TemplatesUpdated
source: Model/repository templates updated.
pt_br: Templates de model/repositório atualizados.

source: Invalid export path.
pt_br: Caminho de exportação inválido.

source: Settings exported successfully.
pt_br: Configurações exportadas com sucesso.

source: Invalid import path.
pt_br: Caminho de importação inválido.

source: Invalid or empty settings file.
pt_br: Arquivo de configuração vazio ou inválido.

source: Settings imported successfully.
pt_br: Configurações importadas com sucesso.

# ObjectsUpdatedCount
source: Objects updated for {0} connection(s).
pt_br: Objetos atualizados para {0} conexão(ões).

# PartialUpdateFailureCount
source: Partial update ({0} failure(s)). See logs for details.
pt_br: Atualização parcial ({0} falha(s)). Veja o log para detalhes.

source: No object selected for generation.
pt_br: Nenhum objeto selecionado para geração.

# TestClassGenerationCompletedCount
source: Test class generation completed. Files generated: {0}.
pt_br: Geração de classes de teste concluída. Arquivos gerados: {0}.

source: Connection not found.
pt_br: Conexão não encontrada.

# ScenarioExtractedSuccessfullyPath
source: Scenario extracted successfully: {0}
pt_br: Cenário extraído com sucesso: {0}

source: Checking consistency...
pt_br: Checando consistência...

# NoObjectsLoadedForConsistency
source: No objects loaded to check consistency.
pt_br: Nenhum objeto carregado para checar consistência.

# MappingNotFoundForConnection
source: Mapping not found for selected connection.
pt_br: Mapeamento não encontrado para a conexão selecionada.

# MissingGeneratedFiles
source: Missing generated files (class/model/repository).
pt_br: Arquivos gerados ausentes (classe/model/repositório).

# ConsistencyCheckCompletedCount
source: Consistency check finished for {0} object(s).
pt_br: Checagem de consistência finalizada para {0} objeto(s).

# InvalidLocalStateStartingEmpty
source: Invalid local state. Starting with empty configuration.
pt_br: Estado local inválido. Iniciando com configuração vazia.

# IndexesLabel
source: Indexes
pt_br: Índices

# OperationAlreadyInProgress
source: An operation is already in progress.
pt_br: Já existe uma operação em andamento.

# SelectObjectTypeToConfigureMappings
source: Select an object type to configure mappings.
pt_br: Selecione um tipo de objeto para configurar mapeamentos.

# SelectObjectTypeToConfigureTemplates
source: Select an object type to configure templates.
pt_br: Selecione um tipo de objeto para configurar templates.

# SelectObjectTypeToConfigureFilter
source: Select an object type to configure the filter.
pt_br: Selecione um tipo de objeto para configurar o filtro.

# SelectObjectTypeToClearFilter
source: Select an object type to clear the filter.
pt_br: Selecione um tipo de objeto para limpar o filtro.

source: Mappings updated.
pt_br: Mapeamentos atualizados.

# NoObjectsLoadedUseRefresh
source: No objects loaded to generate. Use Refresh objects first.
pt_br: Nenhum objeto carregado para gerar. Use Atualizar objetos primeiro.

# NoObjectsLoadedForGeneration
source: No objects loaded to generate.
pt_br: Nenhum objeto carregado para gerar.

# ForeignKeysLabel
source: Foreign keys
pt_br: Chave estrangeira
